test/load-testing/actions.yml

config:
  target: 'http://127.0.0.1:3000' # 'change to AWS env url'
  # http:
  #   # Responses have to be sent within 10 seconds or the request will be aborted
  #   timeout: 5
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 5
      arrivalRate: 5
    - duration: 120
      arrivalRate: 20
  payload:
    path: './actions.csv'
    fields: 
      - "userId"
      - "videoId"
      - "event"
scenarios:
  - name: "Search Tests"
    flow:
    - loop:
      - post:
          url: "/api/search/?userId={{ userId }}"
          json: 
            userId: {{ userId }}
            videoId: {{ videoId }}
            event: {{ event }}
            timestamp: "2018-01-29T22:39:08+00:00"
            search:
              searchId: 34
      - think: 1
      count: 1